---
kind: method
id: M:Autodesk.Revit.DB.ParameterMap.Insert(System.String,Autodesk.Revit.DB.Parameter)
source: html/b84cb6ee-43e0-c888-34fa-e904f8859800.htm
---
# Autodesk.Revit.DB.ParameterMap.Insert Method

Insert the specified item with the specified key into the map.

## Syntax (C#)
```csharp
public virtual bool Insert(
	string key,
	Parameter item
)
```

## Parameters
- **key** (`System.String`) - The key to be used for inserting the item into the map.
- **item** (`Autodesk.Revit.DB.Parameter`) - The item to be inserted into the map.

## Returns
Returns whether the item was inserted into the map.